app/controllers/twitter_controller.rb

  def index
	if !Tweet.first.nil?
---
SELECT  "tweets".* FROM "tweets" ORDER BY "tweets"."id" ASC LIMIT ?  [["LIMIT", 1]]

   def mytweet
	require 'twitter'

	client = Twitter::REST::Client.new do |config|
	  config.consumer_key = "qwSTa4aFJoashomL3gAWFXMTV"
	  config.consumer_secret = "nmBA64tJcZAyc6ejzuMHCFfQDnZMyyQa4K69sUTpKLHLsQQapo"
	  config.access_token = "1188391672406667265-vH15ijJofStsWjxdBOZTtzJUALlqKr"
	  config.access_token_secret = "XAYhr5jHEtdVESeWTQD5x5E7RFFZIbD6mZisY8aLTgDs3"
	end

	timeline = client.user_timeline("freshworksinc")

	timeline.each do |tweet|
	  @tweet=Tweet.new(content: tweet.text ,retweets: tweet.retweet_count)
	  @tweet.save!
---
INSERT INTO "tweets" ("content", "retweets", "created_at", "updated_at") VALUES (?, ?, ?, ?)